<?php
// +----------------------------------------------------------------------+
// | 小金鱼儿 Wordpress 工具集
// +----------------------------------------------------------------------+
// | Copyright (c) 2015 jinyu121
// +----------------------------------------------------------------------+
// | 代码收集自网络，由[小金鱼儿](jinyu121@126.com)编辑整理
// +----------------------------------------------------------------------+
// | 本文件内容：
// |    将content中的http替换成https
// +----------------------------------------------------------------------+

function function_replace_http_with_https($content){
    if( is_ssl() ){
        $content = str_replace('http://', 'https://', $content);
    }
    return $content;
}

add_filter('the_content', 'function_replace_http_with_https');
