<?php
// +----------------------------------------------------------------------+
// | 小金鱼儿 Wordpress 工具集
// +----------------------------------------------------------------------+
// | Copyright (c) 2015 jinyu121
// +----------------------------------------------------------------------+
// | 代码收集自网络，由[小金鱼儿](jinyu121@126.com)编辑整理
// +----------------------------------------------------------------------+
// | 本文件内容：
// |    禁止主题切换
// +----------------------------------------------------------------------+

function function_lock_theme() {
    global $submenu, $userdata;
    get_currentuserinfo();
    if ($userdata->ID != 1) {
        unset($submenu['themes.php'][5]);
        unset($submenu['themes.php'][15]);
    }
}
add_action('admin_init', 'function_lock_theme');
