<?php
// +----------------------------------------------------------------------+
// | 小金鱼儿 Wordpress 工具集
// +----------------------------------------------------------------------+
// | Copyright (c) 2015 jinyu121
// +----------------------------------------------------------------------+
// | 代码收集自网络，由[小金鱼儿](jinyu121@126.com)编辑整理
// +----------------------------------------------------------------------+
// | 本文件内容：
// |    单作者情况下，将 WordPress 的作者存档链接重定向到 about 页面
// +----------------------------------------------------------------------+

function function_redirect_author_archive_link_to_about_page() {
	return home_url( 'about' );
}

add_filter( 'author_link', 'function_redirect_author_archive_link_to_about_page' );
