<?php
// +----------------------------------------------------------------------+
// | 小金鱼儿 Wordpress 工具集
// +----------------------------------------------------------------------+
// | Copyright (c) 2015 jinyu121
// +----------------------------------------------------------------------+
// | 代码收集自网络，由[小金鱼儿](jinyu121@126.com)编辑整理
// +----------------------------------------------------------------------+
// | 本文件内容：
// |    移除留言表单的 URL 字段
// +----------------------------------------------------------------------+

function function_comment_remove_url_area($fields) {
    unset($fields['url']);
    return $fields;
}
add_filter('comment_form_default_fields','function_comment_remove_url_area'); 
