<?php
// +----------------------------------------------------------------------+
// | 小金鱼儿 Wordpress 工具集
// +----------------------------------------------------------------------+
// | Copyright (c) 2015 jinyu121
// +----------------------------------------------------------------------+
// | 代码收集自网络，由[小金鱼儿](jinyu121@126.com)编辑整理
// +----------------------------------------------------------------------+
// | 本文件内容：
// |    Time Ago by Willin Kan.
// +----------------------------------------------------------------------+

/* Time Ago by Willin Kan. */
function theme_time_ago( $type = 'commennt', $day = 14 ) {
    $d = $type == 'post' ? 'get_post_time' : 'get_comment_time';
    if (date('U') - $d('U') > 60*60*24*$day) return;
    printf(' (%s ago)', human_time_diff($d('U'), current_time('timestamp')));
}
