<?php
// +----------------------------------------------------------------------+
// | 小金鱼儿 Wordpress 工具集
// +----------------------------------------------------------------------+
// | Copyright (c) 2015 jinyu121
// +----------------------------------------------------------------------+
// | 代码收集自网络，由[小金鱼儿](jinyu121@126.com)编辑整理
// +----------------------------------------------------------------------+
// | 本文件内容：
// |    评论必须包含汉字
// +----------------------------------------------------------------------+

function comment_chinese_please($incoming_comment) {
    $pattern = '/[一-龥]/u';
    if (!preg_match($pattern, $incoming_comment['comment_content'])) {
        die("为防止垃圾评论，您的评论中必须包含汉字!");
    }
    return ($incoming_comment);
}
add_filter('preprocess_comment', 'comment_chinese_please');
